// 03.1.cpp
// Бойко Марія 
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 1

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу

	cout << "x = "; cin >> x;
	// Обчислюємо функціонально сталу частину
	A = 1 + 9 * x;
	// Спосіб 1: розгалуження в скороченій формі (лише поодинокі if)
	if (x <= 0)
		B = log(abs(sin(x))) + pow(x, 7);
	if (x > 0 && x <= 3)
		B = 1.0 / tan(abs(x + 1.0) / 2.0);
	if (x > 3)
		B = 3 * x - pow(x, 5);

	y = A + B;
	cout << endl;
	cout << "1) y = " << y << endl;

	// Спосіб 2: розгалуження в повній формі (з використанням else)
	if (x <= 0)
		B = log(abs(sin(x))) + pow(x, 7);
	else 
		if (x > 3)
		   B = 3 * x - pow(x, 5);
	    else
		   B = 1.0 / tan(abs(x + 1.0) / 2.0);

	y = A + B;
	cout << "2) y = " << y << endl;

	return 0;
}